<a href="https://colab.research.google.com/github/AmiMunshi/Introduction_to_Python_Programming/blob/main/Unit7_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


Pandas

Pandas is an open-source library 

Provides high-performance data structure

It is easy-to-use data structures and data analysis tools for the Python programming language. 

Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, Statistics, analytics, etc.

In [ ]:
import pandas as pd

In [ ]:
series1= pd.Series([1.5, 2.5, 3.5, 4.5])
print(series1)

0    1.5
1    2.5
2    3.5
3    4.5
dtype: float64

In [ ]:
series2=pd.Series(["A", "B", "C", "D"])

In [ ]:
data= pd.DataFrame({"Name": series2, "Number": series1})
print(data)

  Name  Number
0    A     1.5
1    B     2.5
2    C     3.5
3    D     4.5

In [ ]:
import pandas as pd

name= ["Alpha", "Beta", "Gama", "Zeta"]
age= [20, 23, 21, 22]
country= ["India", "US", "Japan", "Australia"]

In [ ]:
#Create a dataframe from lists

student= pd.DataFrame(name, columns=["Name"])
print(student)

In [ ]:
#Adding column to the data frame
student["Age"]= age
print(student)

    Name  Age
0  Alpha   20
1   Beta   23
2   Gama   21
3   Zeta   22

In [ ]:
#Adding column to the data frame
student["Country"]=country
print(student)

    Name  Age    Country
0  Alpha   20      India
1   Beta   23         US
2   Gama   21      Japan
3   Zeta   22  Australia

In [ ]:
#Creating dataframes from lists using zip()

student_new= list(zip(name, age, country))
student_data= pd.DataFrame(student_new, columns= ["Name", "Age", "Country"])
print(student_data)

    Name  Age    Country
0  Alpha   20      India
1   Beta   23         US
2   Gama   21      Japan
3   Zeta   22  Australia

In [ ]:
#Displaying the entries with age greater than 21 in student_data- Filtering

student_filtered = student_data[student_data["Age"] > 21] 
print(student_filtered)

   Name  Age    Country
1  Beta   23         US
3  Zeta   22  Australia

In [ ]:
#Displaying the entries with age greater than 21 in student_data- Filtering using loc

students_filtered_new= student_data.loc[student_data["Age"]>21]
print(students_filtered_new)

   Name  Age    Country
1  Beta   23         US
3  Zeta   22  Australia

In [ ]:
student_data.set_index("Name")

In [ ]:
#Printing all the age greater than 21
for n in student["Age"]:
  if n>21:
    print(n)

pandas.pydata.org/Pandas_Cheat_Sheet.pdf

In [ ]:
# Create dataframe using Dictionary

import pandas as pd

class_info= {"Name": ["Ram", "Lakshman", "Bharat", "Shatrughna"], "Roll Number": [5,7,9,10]} #dictionary created

class_df= pd.DataFrame(class_info) #create dataframe from a dictionary

print(class_df)

         Name  Roll Number
0         Ram            5
1    Lakshman            7
2      Bharat            9
3  Shatrughna           10

In [ ]:
class_copy= class_df.copy() #copy of the original dataframe created
class_copy= class_copy.set_index("Roll Number")
print(class_copy)

                   Name
Roll Number
5                   Ram
7              Lakshman
9                Bharat
10           Shatrughna

In [ ]:
class_copy["Marks"]= [73,64,89,78]
class_copy["House"]= ["Green", "Blue", "Yellow", "Red"]
print(class_copy)

                   Name  Marks   House
Roll Number
5                   Ram     73   Green
7              Lakshman     64    Blue
9                Bharat     89  Yellow
10           Shatrughna     78     Red

In [ ]:
class_copy.loc[7] #Retrieve all the information at index 7

In [ ]:
class_copy.loc[7:9, "Marks":"House"] #Retrieve only marks at index 7

In [ ]:
class_copy.iloc[2] #All the data in row 2 will be displayed

In [ ]:
class_copy.iloc[2,2] #Retrieve element in 2nd row and 2nd column

In [ ]:
sub=class_copy.iloc[1:3,0:2] #New data frame with elements in rows 1 and 2 and columns 0 and 1
print(sub)

In [ ]:
class_copy.at[7,"Marks"]

In [ ]:
class_copy.loc[7,"Marks"]

In [ ]:
#Write data frame in csv
class_copy.to_csv("class.csv")

In [ ]:
#Read csv file

new_class= pd.read_csv("class.csv", index_col=0)
new_class

                   Name  Marks   House
Roll Number
5                   Ram     73   Green
7              Lakshman     64    Blue
9                Bharat     89  Yellow
10           Shatrughna     78     Red

In [ ]:
dict2= {"Name":['Ram', "Lakshman", "Bharat", "Hanuman"], "Sport": ["Cricket", "Tennis", "Badminton", "Basketball"]} #Define a new dictionary

#Convert this dictionary to data frame

new_class1= pd.DataFrame(dict2)
new_class1

       Name       Sport
0       Ram     Cricket
1  Lakshman      Tennis
2    Bharat   Badminton
3   Hanuman  Basketball

In [ ]:
new= pd.merge(new_class, new_class1, how= "inner")
new

       Name  Marks   House      Sport
0       Ram     73   Green    Cricket
1  Lakshman     64    Blue     Tennis
2    Bharat     89  Yellow  Badminton

In [ ]:
new1= pd.merge(new_class, new_class1, how= "outer")
new1

         Name  Marks   House       Sport
0         Ram   73.0   Green     Cricket
1    Lakshman   64.0    Blue      Tennis
2      Bharat   89.0  Yellow   Badminton
3  Shatrughna   78.0     Red         NaN
4     Hanuman    NaN     NaN  Basketball

In [ ]:
df= new1.dropna()

In [ ]:
print(df)

       Name  Marks   House      Sport
0       Ram   73.0   Green    Cricket
1  Lakshman   64.0    Blue     Tennis
2    Bharat   89.0  Yellow  Badminton

In [ ]:
#using isNull() to find the missing values
new1["Sport"].isnull()

0    False
1    False
2    False
3     True
4    False
Name: Sport, dtype: bool

In [ ]:
new1["Sport"].notnull()

0     True
1     True
2     True
3    False
4     True
Name: Sport, dtype: bool

In [ ]:
#filling the missing values using fillna()
new1["Sport"].fillna("Swimming", inplace=True)

In [ ]:
new1

         Name  Marks   House       Sport
0         Ram   73.0   Green     Cricket
1    Lakshman   64.0    Blue      Tennis
2      Bharat   89.0  Yellow   Badminton
3  Shatrughna   78.0     Red    Swimming
4     Hanuman    NaN     NaN  Basketball

In [ ]:
new1["Marks"].fillna(method="pad", inplace= True)

In [ ]:
new1

         Name  Marks   House       Sport
0         Ram   73.0   Green     Cricket
1    Lakshman   64.0    Blue      Tennis
2      Bharat   89.0  Yellow   Badminton
3  Shatrughna   78.0     Red    Swimming
4     Hanuman   78.0     NaN  Basketball

In [ ]:
new1["House"].fillna(method="ffill", inplace= True)

In [ ]:
new1

         Name  Marks   House       Sport
0         Ram   73.0   Green     Cricket
1    Lakshman   64.0    Blue      Tennis
2      Bharat   89.0  Yellow   Badminton
3  Shatrughna   78.0     Red    Swimming
4     Hanuman   78.0     Red  Basketball